/*
1. book 도서 개체
2. customer 고객 개체
3. orders 주문 개체

*/

# 1. 서점은 출판사에서 도서를 공급받아 판매한다.

# 2. 판매내역은 매일 기록으로 남겨야 한다. ==> 고객서비스와 매출관리에 활용

# 3. 서점은 판매하는 도서의 도서번호, 도서이름, 출판사, 도서단가를 갖는다.

# 4. 구매한 도서들은 납품한 출판사와 출판사 담당자 이름, 전화번호를 갖는다.

# 5. 고객이 책을 주물할때마다 주문번호를 기록해야 한다.

# 6. 고객에게 판매한 도서는 판매한 날, 고객별 주문금액 추가로 관리해야 한다.

# 7. 고객들은 여러 번에 걸쳐 다양한 도서를 구매할 수 있다.

# 개념설계 / 논리설계 (개체와 관계를 구분하여 정리한다.)
-- 도서 (도서번호, 도서이름, 출판사, 도서단가) - E
-- 고객 (고객번호, 고객이름, 주소 , 전화번호) - E
-- 출판사 (출판사 이름, 담당자 이름, 전화번호) - E

-- 출판사1 : 도서N (서점은 출판사로부터 공급한 도서만 등록하여 관리) - 비식별자 관계
-- 고객N : 도서M	 - 식별관계 ==> 주문 관계 표현 (도서와 고객의 PK)
-- 주문관계 (교차 테이블)
	-- (고객이 도서를 구입한 날(주문일자), 구매한 가격(주문금액)을 따로 저장한다.)
	-- (고객과 도서의 관계에 속성이 존재)
				